newsletter/app/controllers/subscribers_controller.rb

  def create
    @subscriber = Subscriber.find_by_email(params[:subscriber][:email])

    if @subscriber.blank?
      @subscriber = Subscriber.new(params[:subscriber])
      valid = @subscriber.save
---
SELECT `subscribers`.id FROM `subscribers` WHERE (LOWER(`subscribers`.`email`) = BINARY '') LIMIT 1
INSERT INTO `subscribers` (`verification_status`, `first_name`, `gender`, `state`, `updated_at`, `zipcode`, `age`, `city`, `phone_no`, `last_name`, `address1`, `address2`, `email`, `created_at`) VALUES(NULL, NULL, NULL, NULL, '2012-03-26 11:23:26', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '', '2012-03-26 11:23:26')

  def edit
    @subscriber = Subscriber.find(params[:id])
---
SELECT * FROM `subscribers` WHERE (`subscribers`.`id` = 6)