survey/app/controllers/surveys_controller.rb

  def twe
    @survey = Survey.find_by_id( 39 )
---
SELECT * FROM `surveys` WHERE (`surveys`.`id` = 39) LIMIT 1

      if quiz_instance_uuid.size > 0
        session[ :quiz_instance_uuid ] = quiz_instance_uuid[ 0 ].content
        if session[ :survey_instance_id ]
          si = SurveyInstance.find( session[ :survey_instance_id ] )
          si.quiz_instance_uuid = quiz_instance_uuid[ 0 ].content
          si.save
---
SELECT * FROM `survey_instances` WHERE (`survey_instances`.`id` = 43)
UPDATE `survey_instances` SET `updated_at` = '2011-05-23 11:30:18', `quiz_instance_uuid` = 'f5b36240675d012ef1a31c750856b6ea' WHERE `id` = 43

  def show
    #sniff the url to determine our survey id
    if params[ :id ]

      #use the survey id to determine the quiz we want to display
      @survey = Survey.find( :first, :conditions => ["id = ? AND partner_site_id = ?", params[:id], @partner_site.id] )

      if @survey
        #Grab the appropriate quiz, ensuring that it is available to this partner_site
        @quiz = Quiz.first( :joins => :shared_quizzes, :conditions => [ "quizzes.id = ? and shared_quizzes.partner_site_id = ?", @survey.quiz_id, @partner_site.id ] )
---
SELECT * FROM `surveys` WHERE (id = '39' AND partner_site_id = 2) LIMIT 1
SELECT `quizzes`.* FROM `quizzes` INNER JOIN `shared_quizzes` ON shared_quizzes.quiz_id = quizzes.id WHERE (quizzes.id = 103 and shared_quizzes.partner_site_id = 2) LIMIT 1

 def start
    ## bhavan: changed to remove Omniauth, otherwize all surveys are going to twe

    #this is where you get all the data from your provider through omniauth
    #omniauth = request.env['rack.auth']
    #
    #if omniauth
    #  @si = SurveyInstance.create!(
    #    :customer_email =>  omniauth['extra']['user_hash']['email'],
    #    :name_first     =>  omniauth['user_info']['first_name'],
    #    :name_last      =>  omniauth['user_info']['last_name'],
    #    #        :city           =>  omniauth['extra']['user_hash']['hometown']['name'].split(',')[0],
    #    #        :state          =>  omniauth['extra']['user_hash']['hometown']['name'].split(',')[1],
    #    :gender         =>  omniauth['extra']['user_hash']['gender'],
    #    :uid            =>  omniauth['uid'],
    #    :provider       =>  omniauth['provider']
    #  )
    #  session[ :survey_instance_id ] = @si.id
    #  redirect_to "/surveys/39"
    #else
      @si = SurveyInstance.create!(
        :customer_email =>  params[ :user ][:email]
      )
---
INSERT INTO `survey_instances` (`address1`, `city`, `created_at`, `name_last`, `address2`, `dob`, `store_code`, `updated_at`, `zipcode`, `quiz_instance_id`, `quiz_instance_uuid`, `year_of_birth`, `register_number`, `cashier_number`, `customer_email`, `phone`, `name_first`, `survey_code`, `state_id`) VALUES(NULL, NULL, '2011-05-23 11:22:39', NULL, NULL, NULL, 234234, '2011-05-23 11:22:39', NULL, NULL, NULL, NULL, '', '', 'nimesh.nikum@aaditsoftware.com', NULL, NULL, NULL, NULL)

  def submit_answers

    #sniff the url to determine our survey id
    if params[ :id ]

      #use the survey id to determine the quiz we want to display
      @survey = Survey.find( :first, :conditions => ["id = ? AND partner_site_id = ?", params[:id], @partner_site.id] )

      if @survey
        #Grab the appropriate quiz, ensuring that it is available to this partner_site
        @quiz = Quiz.first( :joins => :shared_quizzes, :conditions => [ "quizzes.id = ? and shared_quizzes.partner_site_id = ?", @survey.quiz_id, @partner_site.id ] )
---
SELECT * FROM `surveys` WHERE (id = '39' AND partner_site_id = 2) LIMIT 1
SELECT `quizzes`.* FROM `quizzes` INNER JOIN `shared_quizzes` ON shared_quizzes.quiz_id = quizzes.id WHERE (quizzes.id = 103 and shared_quizzes.partner_site_id = 2) LIMIT 1

  def load_survey
    if params[ :id ]
      #use the survey id to determine the quiz we want to display
      @survey = Survey.find( :first, :conditions => ["id = ? AND partner_site_id = ?", params[:id], @partner_site.id] )

      if @survey
        #Grab the appropriate quiz, ensuring that it is available to this partner_site
        @quiz = Quiz.first( :joins => :shared_quizzes, :conditions => [ "quizzes.id = ? and shared_quizzes.partner_site_id = ?", @survey.quiz_id, @partner_site.id ] )
---
SELECT * FROM `surveys` WHERE (id = '39' AND partner_site_id = 2) LIMIT 1
SELECT `quizzes`.* FROM `quizzes` INNER JOIN `shared_quizzes` ON shared_quizzes.quiz_id = quizzes.id WHERE (quizzes.id = 103 and shared_quizzes.partner_site_id = 2) LIMIT 1